In [42]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.linear_model import LogisticRegression
from sklearn.metric import f1_score

ModuleNotFoundError: No module named 'sklearn.metric'

In [2]:
test = pd.read_csv('data/test.csv')
train = pd.read_csv('data/train.csv')
samplesubmission = pd.read_csv('data/sample_submission.csv')

In [3]:
test.head()

,traveller_ID,ticket_class,name,sex,age,Siblings_spouses,Parchil,TickNum,fare,cabin,embarked,MedBoat
0,1148,3.0,"Rintamaki, Mr. Matti",male,35.0,0.0,0.0,STON/O 2. 3101273,7.1250,NaN,S,NaN
1,1049,3.0,"Nakid, Mr. Sahid",male,20.0,1.0,1.0,2653,15.7417,NaN,C,C
2,982,3.0,"Lyntakoff, Mr. Stanko",male,NaN,0.0,0.0,349235,7.8958,NaN,S,NaN
3,808,3.0,"Ford, Mr. Arthur",male,NaN,0.0,0.0,A/5 1478,8.0500,NaN,S,NaN
4,1195,3.0,"Shaughnessy, Mr. Patrick",male,NaN,0.0,0.0,370374,7.7500,NaN,Q,NaN

In [4]:
train.head()

,traveller_ID,ticket_class,name,sex,age,Siblings_spouses,Parchil,TickNum,fare,cabin,embarked,MedBoat,Survived
0,1214,3,"Smiljanic, Mr. Mile",male,NaN,0,0,315037,8.6625,NaN,S,NaN,0
1,677,3,"Bostandyeff, Mr. Guentcho",male,26.0,0,0,349224,7.8958,NaN,S,NaN,0
2,534,2,"Phillips, Miss. Kate Florence (""Mrs Kate Louis...",female,19.0,0,0,250655,26.0000,NaN,S,11,1
3,1174,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S,NaN,0
4,864,3,"Henriksson, Miss. Jenny Lovisa",female,28.0,0,0,347086,7.7750,NaN,S,NaN,0

In [5]:
samplesubmission.head()

   traveller_ID  Survived
0          1148         0
1          1049         1
2           982         0
3           808         1
4          1195         0

In [6]:
target = [col for col in train.columns if col not in test.columns]
target

['Survived']

In [7]:
categorical_feat = [ feat for feat in train.columns if train[feat].dtype == "O"]
categorical_feat

['name', 'sex', 'TickNum', 'cabin', 'embarked', 'MedBoat']

In [8]:
num_feat = [feat for feat in train.columns if feat not in categorical_feat]
num_feat

['traveller_ID',
 'ticket_class',
 'age',
 'Siblings_spouses',
 'Parchil',
 'fare',
 'Survived']

In [9]:
rem = ['traveller_ID', 'Survived']
for i in rem:
    num_feat.remove(i)
num_feat

['ticket_class', 'age', 'Siblings_spouses', 'Parchil', 'fare']

In [10]:
mean_age = np.round(train.age.mean())

In [17]:
mean_age

29.0

In [32]:
train.age.fillna(mean_age, inplace = True)
test.age.fillna(mean_age, inplace = True)

In [15]:
fare_mode = train.fare.mode()
fare_mode

0     8.05
1    26.00
dtype: float64

In [16]:
fare_mode = (train.fare.mode()[0] + train.fare.mode()[1])/2
fare_mode

17.025

In [31]:
train.fare.fillna(fare_mode, inplace = True)
test.fare.fillna(fare_mode, inplace = True)

train[num_feat].describe()

In [20]:
train[num_feat].head()

   ticket_class   age  Siblings_spouses  Parchil     fare
0             3  29.0                 0        0   8.6625
1             3  26.0                 0        0   7.8958
2             2  19.0                 0        0  26.0000
3             3  29.0                 8        2  69.5500
4             3  28.0                 0        0   7.7750

In [37]:
scaler = StandardScaler()
cols = num_feat
X = scaler.fit_transform(train[num_feat])
testing = scaler.transform(test[num_feat])
X = pd.DataFrame(data = X, columns = cols)
testing = pd.DataFrame(data = test, columns = cols)
X.head()

   ticket_class       age  Siblings_spouses   Parchil      fare
0      0.825248 -0.006586         -0.498616 -0.432553 -0.474152
1      0.825248 -0.249258         -0.498616 -0.432553 -0.488677
2     -0.363317 -0.815493         -0.498616 -0.432553 -0.145702
3      0.825248 -0.006586          6.897852  1.805972  0.679330
4      0.825248 -0.087477         -0.498616 -0.432553 -0.490965

In [39]:
X_train, X_test, y_train, y_test = train_test_split(  X, train.Survived, test_size=0.20, random_state=42)

In [40]:
classifier = LogisticRegression()
classifier.fit(X_train, y_train)

C:\Users\HACADEMY\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [41]:
pred = classifier.predict(X_test)
pred2 = classifier.predict(X_train)

In [29]:
testing.head()

   ticket_class   age  Siblings_spouses  Parchil     fare
0           3.0  35.0               0.0      0.0   7.1250
1           3.0  20.0               1.0      1.0  15.7417
2           3.0  29.0               0.0      0.0   7.8958
3           3.0  29.0               0.0      0.0   8.0500
4           3.0  29.0               0.0      0.0   7.7500